app/controllers/line_items_controller.rb

  def show
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1

  def edit
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = 2 ORDER BY title LIMIT 1
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2011-06-04 14:45:00.016109', '2011-06-04 14:45:00.016109')
INSERT INTO "line_items" ("updated_at", "created_at", "quantity", "product_id", "cart_id") VALUES ('2011-06-04 15:44:50.172359', '2011-06-04 15:44:50.172359', 1, 207281424, 980190963)
UPDATE "line_items" SET "updated_at" = '2011-06-04 13:57:46.839078', "quantity" = 2 WHERE "line_items"."id" = 1

  def update
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1

  def destroy
    @line_item = LineItem.find(params[:id])
    @line_item.destroy
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1
DELETE FROM "line_items" WHERE "line_items"."id" = 980190962